In [11]:
# This Python 3 environment comes with many helpful analytics libraries installed
# It is defined by the kaggle/python docker image: https://github.com/kaggle/docker-python
# For example, here's several helpful packages to load in 

import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

# Input data files are available in the "../input/" directory.
# For example, running this (by clicking run or pressing Shift+Enter) will list the files in the input directory

import os
print(os.listdir("../input"))

# Any results you write to the current directory are saved as output.

['store-master', 'customer-transaction', 'test-set', 'customer-demographics']

In [16]:
cd = pd.read_excel("../input/customer-demographics/Customer_Demographics.xlsx")
ct = pd.read_excel("../input/customer-transaction/Customer_Transaction.xlsx")
sm = pd.read_excel("../input/store-master/Store_Master.xlsx")
test = pd.read_excel("../input/test-set/Test_Set.xlsx")

In [25]:
cd.head()

        Customer_ID         ...             Last_rdm_txn_dt
0  1800000006365760         ...          11MAR2018:19:11:57
1  1800000006365820         ...          16MAR2015:13:39:12
2  1800000006366060         ...          30JAN2017:19:19:19
3  1800000006366230         ...          20JUN2017:17:57:27
4  1800000006366570         ...          17JUN2017:23:08:28

[5 rows x 16 columns]

In [24]:
ct.head()

              Territory Business     ...      Discount  Units_Sold
0  United Arab Emirates      Max     ...           0.0          -3
1  United Arab Emirates      Max     ...           0.0           0
2  United Arab Emirates      Max     ...           0.0           0
3  United Arab Emirates      Max     ...           0.0           0
4  United Arab Emirates      Max     ...           0.0           0

[5 rows x 15 columns]

In [26]:
sm.head()

              Territory Business      ...       Customer_Count  Total_Revenue
0  United Arab Emirates      Max      ...              22237.0   1.131676e+07
1  United Arab Emirates      Max      ...              88372.0   2.603446e+07
2  United Arab Emirates      Max      ...             188836.0   6.905362e+07
3  United Arab Emirates      Max      ...              96733.0   2.519873e+07
4  United Arab Emirates      Max      ...              70456.0   4.621496e+07

[5 rows x 15 columns]

In [20]:
test.head()

        Customer_ID  Store_Code
0  1800000006365760       60298
1  1800000006365760       60299
2  1800000006365760       60300
3  1800000006365760       60301
4  1800000006365820       60298

In [31]:
list(cd)

['Customer_ID',
 'Territory',
 'Nationality',
 'Income_Range',
 'Job_Type',
 'Marital_Status',
 'Gender',
 'State',
 'Language',
 'Loyalty_Status',
 'Birth_date',
 'Age',
 'Points',
 'First_txn_dt',
 'Last_accr_txn_dt',
 'Last_rdm_txn_dt']

In [32]:
list(ct)

['Territory',
 'Business',
 'Year',
 'Week',
 'Store_Code',
 'City_Name',
 'Store_Type',
 'Transaction_Type',
 'Return_Reason',
 'Customer_ID',
 'Invoices',
 'Item_Count',
 'Revenue',
 'Discount',
 'Units_Sold']

In [33]:
list(sm)

['Territory',
 'Business',
 'Region',
 'Region_Code',
 'Store_Code',
 'Store_Name',
 'Mall_Name',
 'Store_Format',
 'Sales_Per_Day',
 'Store_Launch_Date',
 'Train_Test_Store',
 'Geo_Field',
 'Store_Size_Sq_Ft',
 'Customer_Count',
 'Total_Revenue']